01 person.
    02 firstname pic x(30).
    02 lastname  pic x(30).
    02 date-of-birth.
        03 date-of-birth-year  pic 9(04).
        03 date-of-birth-month pic 9(02).
        03 date-of-birth-day   pic 9(02).